MIN_SALARY_BASE = 10_000
MAX_SALART_BASE = 20_000

POSITIONS_LVL_1 = 'Генеральный директор', "Тёмный лорд ситхов"
SALARY_LVL_1 = 1_500_000, 1_750_000, 2_000_000, 2_250_000, 2_500_000

POSITIONS_LVL_2 = 'Главный бухгалтер', 'Главный диспетчер', 'Главный инженер', 'Главный конструктор', \
                  'Директор по безопасности', 'Главный юрист', 'Главный технолог', 'Главный энергетик'
SALARY_LVL_2 = 500_000, 550_000, 600_000, 650_000, 700_000, 750_000, 800_000, 850_000, 900_000, 950_000

POSITIONS_LVL_3 = 'Начальник', 'Заведущий', 'Старший менеджер', "Председатель", "Рыцарь-джедай"
SALARY_LVL_3 = 350_000, 400_000, 450_000, 500_000, 550_000, 600_000

POSITIONS_LVL_4 = 'Старший менеджер', "Менеджер", "Руководитель", "Супервайзер", "Падаван"
SALARY_LVL_4 = 100_000, 110_000, 120_000, 130_000, 140_000, 150_000, 200_000

POSITIONS_LVL_5 = 'Аналитик', 'Аудитор', 'Документовед', 'Инженер', 'Лаборант', 'Инспектор', \
                  'Психолог', 'Cпециалист', 'Техник', 'Экономист', 'Эксперт', 'Юристконсульт', "Юнлинг"
SALARY_LVL_5 = 50_000, 55_000, 60_000, 65_000, 70_000, 75_000, 80_000, 85_000, 90_000, 95_000, 100_000

POSITIONS = {
    1: POSITIONS_LVL_1,
    2: POSITIONS_LVL_2,
    3: POSITIONS_LVL_3,
    4: POSITIONS_LVL_4,
    5: POSITIONS_LVL_5,
}

SALARIES = {
    1: SALARY_LVL_1,
    2: SALARY_LVL_2,
    3: SALARY_LVL_3,
    4: SALARY_LVL_4,
    5: SALARY_LVL_5,
}
